// ! Exercise 1
// * 1
// const numbers = [2,-5,-9,2,-4,5,34,-11,2,3,-4,5,-6,9]

// let sum = 0

// for (let i = 0; i < numbers.length; i++) {
//     if (numbers[i] < 0) {
//         sum += numbers[i]
//     }
// }

// console.log('Сума відємних елементів становить:' + ' ' + sum);

// * 2

// let sum2 = 0

// for (let i = 0; i < numbers.length; i++) {
//     if (numbers[i] < 34 && numbers[i] > -11) {
//         sum2 += numbers[i]
//     }
// }

// console.log('Сума між найбільшим та найменшим елементом в цьому масиві становить:' + ' ' + sum2);

// ! Exercise 2
// * 1
// let arr = [45,-65,48,52,-45,-78,-96,25,14,25,45]

// let sum = 0

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 === 0) {
//         sum += arr[i]
//     }
// }

// * 2

// let sum2 = 0

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > -96 && arr[i] < 65) {
//         sum2 += arr[i]
//     }
// }

// console.log('Сума парних елементів:' + ' ' + sum);
// console.log('Сума елементів розташованих між найбільшим та найменшим значенням:' + ' ' + sum2);

// ! Exercise 3
// * 1
// let arr = [45,65,48,52,45,-78,-96,25,14,25,45]

// let maxnumber = 0

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > maxnumber) {
//         maxnumber = arr[i]
//     }
// }

// console.log('Максимальне число масиву:' + ' ' + maxnumber);

// * 2

// let notminus = 0

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > 0) {
//         notminus += arr[i]
//     }else{
//         break
//     }
// }

// console.log('Сума елементів до першого відємного елемента становить:' + ' ' + notminus);

// ! Exercise 4
// * 1
//  const a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
//     11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
//     21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
//     31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
//     41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
//     51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
//     61, 62, 63, 64, 65, 66, 67, 68, 69, 70,
//     71, 72, 73, 74, 75, 76, 77, 78, 79, 80,
//     81, 82, 83, 84, 85, 86, 87, 88, 89, 90,
//     91, 92, 93, 94, 95, 96, 97, 98, 99, 100]

//     let sum = 0

// for (let i = 0; i < a.length; i++) {
//     sum += a[i]
// }

// console.log('Сума цих чисел:' + ' ' + sum);

// ! Exercise 5
// * 1

// const b = [12, -7, 45, 23, -18, 34, 67, -3, 91, 0,
//     -15, 8, 56, -22, 39, 73, -5, 27, 82, -11,
//     10, 44, -4, 59, 16, -29, 30, 77, -13, 61,
//     5, -20, 86, -8, 35, 14, -9, 50, 2, -33,
//     65, 19, -1, 88, 21, -14, 38, -6, 72, -30]

// let sum = 0

// for (let i = 0; i < b.length; i++) {
//     if (b[i] % 2 !== 0) {
//         sum += b[i]
//     }
// }

// console.log('Сума непарних чисел:' + ' ' + sum);

// ! Exercise 6
// ? я незнаю як його забабахати