const country = prompt('Виберіть країну: \n Україна \n Німечинна \n Франція \n Австрія \n Болгарія')
switch (country) {
    case 'Україна':
    alert('Україна\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Київ\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\n Українська \n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nПарламентсько президенська республіка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 24 серпня 1991\n-------------------------\nПЛОЩА\n-------------------------\n603 628 км' )
    break
    case 'україна':
    alert('Україна\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Київ\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\n Українська \n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nПарламентсько президенська республіка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 24 серпня 1991\n-------------------------\nПЛОЩА\n-------------------------\n603 628 км' )
    break
    case 'Німечинна':
    alert('Німечинна\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Берлін\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\n Німецька\n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nФедеративна республіка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 3 жовтня 1990р\n-------------------------\nПЛОЩА\n-------------------------\n357 022 км' )
    break
    case 'німечинна':
    alert('Німечинна\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Берлін\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\nНімецька \n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nФедеративна республіка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 3 жовтня 1990р\n-------------------------\nПЛОЩА\n-------------------------\n357 022 км' )
    break
    case 'Франція':
    alert('Франція\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Париж\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\n Французька\n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nреспубліка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 24 вересня 843р\n-------------------------\nПЛОЩА\n-------------------------\n551 695км' )
    break
    case 'франція':
    alert('Франція\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Париж\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\nФранцузька \n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nреспубліка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 24 вересня 843р\n-------------------------\nПЛОЩА\n-------------------------\n551 695км' )
    break
    case 'Австрія':
    alert('Австрія\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Відень\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\n Німецька\n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nФедеративна республіка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 12 листопада 1918р\n-------------------------\nПЛОЩА\n-------------------------\n83 871км' )
    break
    case 'австрія':
    alert('Австрія\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Відень\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\nНімецька \n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nФедеративна республіка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 12 листопада 1918р\n-------------------------\nПЛОЩА\n-------------------------\n83 871км' )
    break
    case 'Болгарія':
    alert('Болгарія\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Софія\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\n Болгарська\n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nПарламентська республіка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 5жовтня 1908р\n-------------------------\nПЛОЩА\n-------------------------\n 110 879км' )
    break
    case 'болгарія':
    alert('Болгарія\n-------------------------\n СТОЛИЦЯ\n-------------------------\n Софія\n -------------------------\n ОФІЦІЙНА МОВА\n-------------------------\nБолгарська \n-------------------------\n ДЕРЖАВНИЙ УСТРІЙ\n-------------------------\nПарламентська республіка\n-------------------------\nНЕЗАЛЕЖНІСТЬ\n-------------------------\n 5жовтня 1908р\n-------------------------\nПЛОЩА\n-------------------------\n 110 879км' )
    break
    default:
        alert('Сорі такої країни в нашому списку немає')
        break
}
